In [1]:
pip install pandas numpy seaborn matplotlib

Requirement already satisfied: pandas in c:\users\bhakti\anaconda3\lib\site-packages (2.2.2)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy in c:\users\bhakti\anaconda3\lib\site-packages (1.26.4)
Requirement already satisfied: seaborn in c:\users\bhakti\anaconda3\lib\site-packages (0.13.2)
Requirement already satisfied: matplotlib in c:\users\bhakti\anaconda3\lib\site-packages (3.9.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bhakti\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bhakti\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\bhakti\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (24.1)
Requirement already satisfied: pillow>=8 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (10.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\bhakti\anaconda3\lib\site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: six>=1.5 in c:\users\bhakti\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
import seaborn as sns

In [11]:
titanic = sns.load_dataset('Titanic')

In [8]:
pip show seaborn

Name: seaborn
Version: 0.13.2
Summary: Statistical data visualization
Home-page:
Author:
Author-email: Michael Waskom <mwaskom@gmail.com>
License:
Location: C:\Users\Bhakti\anaconda3\Lib\site-packages
Requires: matplotlib, numpy, pandas
Required-by:
Note: you may need to restart the kernel to use updated packages.

In [9]:
pip show pandas

Name: pandas
Version: 2.2.2
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author:
Author-email: The Pandas Development Team <pandas-dev@python.org>
License: BSD 3-Clause License

Copyright (c) 2008-2011, AQR Capital Management, LLC, Lambda Foundry, Inc. and PyData Development Team
All rights reserved.

Copyright (c) 2011-2023, Open source contributors.

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

* Redistributions of source code must retain the above copyright notice, this
  list of conditions and the following disclaimer.

* Redistributions in binary form must reproduce the above copyright notice,
  this list of conditions and the following disclaimer in the documentation
  and/or other materials provided with the distribution.

* Neither the name of the copyright holder nor the names of its
  contributors may be used to endorse or promote products derived from
  this software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
Location: C:\Users\Bhakti\anaconda3\Lib\site-packages
Requires: numpy, python-dateutil, pytz, tzdata
Required-by: altair, bokeh, dask-expr, datashader, holoviews, hvplot, panel, seaborn, statsmodels, streamlit, xarray
Note: you may need to restart the kernel to use updated packages.

In [12]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [13]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
ages = np.array(titanic['age'].dropna())

In [15]:
ages

array([22.  , 38.  , 26.  , 35.  , 35.  , 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 14.  , 55.  ,  2.  , 31.  , 35.  ,
       34.  , 15.  , 28.  ,  8.  , 38.  , 19.  , 40.  , 66.  , 28.  ,
       42.  , 21.  , 18.  , 14.  , 40.  , 27.  ,  3.  , 19.  , 18.  ,
        7.  , 21.  , 49.  , 29.  , 65.  , 21.  , 28.5 ,  5.  , 11.  ,
       22.  , 38.  , 45.  ,  4.  , 29.  , 19.  , 17.  , 26.  , 32.  ,
       16.  , 21.  , 26.  , 32.  , 25.  ,  0.83, 30.  , 22.  , 29.  ,
       28.  , 17.  , 33.  , 16.  , 23.  , 24.  , 29.  , 20.  , 46.  ,
       26.  , 59.  , 71.  , 23.  , 34.  , 34.  , 28.  , 21.  , 33.  ,
       37.  , 28.  , 21.  , 38.  , 47.  , 14.5 , 22.  , 20.  , 17.  ,
       21.  , 70.5 , 29.  , 24.  ,  2.  , 21.  , 32.5 , 32.5 , 54.  ,
       12.  , 24.  , 45.  , 33.  , 20.  , 47.  , 29.  , 25.  , 23.  ,
       19.  , 37.  , 16.  , 24.  , 22.  , 24.  , 19.  , 18.  , 19.  ,
       27.  ,  9.  , 36.5 , 42.  , 51.  , 22.  , 55.5 , 40.5 , 51.  ,
       16.  , 30.  , 44.  , 40.  , 26.  , 17.  ,  1.  ,  9.  , 45.  ,
       28.  , 61.  ,  4.  ,  1.  , 21.  , 56.  , 18.  , 50.  , 30.  ,
       36.  ,  9.  ,  1.  ,  4.  , 45.  , 40.  , 36.  , 32.  , 19.  ,
       19.  ,  3.  , 44.  , 58.  , 42.  , 24.  , 28.  , 34.  , 45.5 ,
       18.  ,  2.  , 32.  , 26.  , 16.  , 40.  , 24.  , 35.  , 22.  ,
       30.  , 31.  , 27.  , 42.  , 32.  , 30.  , 16.  , 27.  , 51.  ,
       38.  , 22.  , 19.  , 20.5 , 18.  , 35.  , 29.  , 59.  ,  5.  ,
       24.  , 44.  ,  8.  , 19.  , 33.  , 29.  , 22.  , 30.  , 44.  ,
       25.  , 24.  , 37.  , 54.  , 29.  , 62.  , 30.  , 41.  , 29.  ,
       30.  , 35.  , 50.  ,  3.  , 52.  , 40.  , 36.  , 16.  , 25.  ,
       58.  , 35.  , 25.  , 41.  , 37.  , 63.  , 45.  ,  7.  , 35.  ,
       65.  , 28.  , 16.  , 19.  , 33.  , 30.  , 22.  , 42.  , 22.  ,
       26.  , 19.  , 36.  , 24.  , 24.  , 23.5 ,  2.  , 50.  , 19.  ,
        0.92, 17.  , 30.  , 30.  , 24.  , 18.  , 26.  , 28.  , 43.  ,
       26.  , 24.  , 54.  , 31.  , 40.  , 22.  , 27.  , 30.  , 22.  ,
       36.  , 61.  , 36.  , 31.  , 16.  , 45.5 , 38.  , 16.  , 29.  ,
       41.  , 45.  , 45.  ,  2.  , 24.  , 28.  , 25.  , 36.  , 24.  ,
       40.  ,  3.  , 42.  , 23.  , 15.  , 25.  , 28.  , 22.  , 38.  ,
       40.  , 29.  , 45.  , 35.  , 30.  , 60.  , 24.  , 25.  , 18.  ,
       19.  , 22.  ,  3.  , 22.  , 27.  , 20.  , 19.  , 42.  ,  1.  ,
       32.  , 35.  , 18.  ,  1.  , 36.  , 17.  , 36.  , 21.  , 28.  ,
       23.  , 24.  , 22.  , 31.  , 46.  , 23.  , 28.  , 39.  , 26.  ,
       21.  , 28.  , 20.  , 34.  , 51.  ,  3.  , 21.  , 33.  , 44.  ,
       34.  , 18.  , 30.  , 10.  , 21.  , 29.  , 28.  , 18.  , 28.  ,
       19.  , 32.  , 28.  , 42.  , 17.  , 50.  , 14.  , 21.  , 24.  ,
       64.  , 31.  , 45.  , 20.  , 25.  , 28.  ,  4.  , 13.  , 34.  ,
        5.  , 52.  , 36.  , 30.  , 49.  , 29.  , 65.  , 50.  , 48.  ,
       34.  , 47.  , 48.  , 38.  , 56.  ,  0.75, 38.  , 33.  , 23.  ,
       22.  , 34.  , 29.  , 22.  ,  2.  ,  9.  , 50.  , 63.  , 25.  ,
       35.  , 58.  , 30.  ,  9.  , 21.  , 55.  , 71.  , 21.  , 54.  ,
       25.  , 24.  , 17.  , 21.  , 37.  , 16.  , 18.  , 33.  , 28.  ,
       26.  , 29.  , 36.  , 54.  , 24.  , 47.  , 34.  , 36.  , 32.  ,
       30.  , 22.  , 44.  , 40.5 , 50.  , 39.  , 23.  ,  2.  , 17.  ,
       30.  ,  7.  , 45.  , 30.  , 22.  , 36.  ,  9.  , 11.  , 32.  ,
       50.  , 64.  , 19.  , 33.  ,  8.  , 17.  , 27.  , 22.  , 22.  ,
       62.  , 48.  , 39.  , 36.  , 40.  , 28.  , 24.  , 19.  , 29.  ,
       32.  , 62.  , 53.  , 36.  , 16.  , 19.  , 34.  , 39.  , 32.  ,
       25.  , 39.  , 54.  , 36.  , 18.  , 47.  , 60.  , 22.  , 35.  ,
       52.  , 47.  , 37.  , 36.  , 49.  , 49.  , 24.  , 44.  , 35.  ,
       36.  , 30.  , 27.  , 22.  , 40.  , 39.  , 35.  , 24.  , 34.  ,
       26.  ,  4.  , 26.  , 27.  , 42.  , 20.  , 21.  , 21.  , 61.  ,
       57.  , 21.  , 26.  , 80.  , 51.  , 32.  ,  9.  , 28.  , 32.  ,
       31.  , 41.  , 20.  , 24.  ,  2.  ,  0.75, 48.  , 19.  , 56.  ,
       23.  , 18.  , 21.  , 18.  , 24.  , 32.  , 23.  , 58.  , 50.  ,
       40.  , 47.  , 36.  , 20.  , 32.  , 25.  , 43.  , 40.  , 31.  ,
       70.  , 31.  , 18.  , 24.5 , 18.  , 43.  , 36.  , 27.  , 20.  ,
       14.  , 60.  , 25.  , 14.  , 19.  , 18.  , 15.  , 31.  ,  4.  ,
       25.  , 60.  , 52.  , 44.  , 49.  , 42.  , 18.  , 35.  , 18.  ,
       25.  , 26.  , 39.  , 45.  , 42.  , 22.  , 24.  , 48.  , 29.  ,
       52.  , 19.  , 38.  , 27.  , 33.  ,  6.  , 17.  , 34.  , 50.  ,
       27.  , 20.  , 30.  , 25.  , 25.  , 29.  , 11.  , 23.  , 23.  ,
       28.5 , 48.  , 35.  , 36.  , 21.  , 24.  , 31.  , 70.  , 16.  ,
       30.  , 19.  , 31.  ,  4.  ,  6.  , 33.  , 23.  , 48.  ,  0.67,
       28.  , 18.  , 34.  , 33.  , 41.  , 20.  , 36.  , 16.  , 51.  ,
       30.5 , 32.  , 24.  , 48.  , 57.  , 54.  , 18.  ,  5.  , 43.  ,
       13.  , 17.  , 29.  , 25.  , 25.  , 18.  ,  8.  ,  1.  , 46.  ,
       16.  , 25.  , 39.  , 49.  , 31.  , 30.  , 30.  , 34.  , 31.  ,
       11.  ,  0.42, 27.  , 31.  , 39.  , 18.  , 39.  , 33.  , 26.  ,
       39.  , 35.  ,  6.  , 30.5 , 23.  , 31.  , 43.  , 10.  , 52.  ,
       27.  , 38.  , 27.  ,  2.  ,  1.  , 62.  , 15.  ,  0.83, 23.  ,
       18.  , 39.  , 21.  , 32.  , 20.  , 16.  , 30.  , 34.5 , 17.  ,
       42.  , 35.  , 28.  ,  4.  , 74.  ,  9.  , 16.  , 44.  , 18.  ,
       45.  , 51.  , 24.  , 41.  , 21.  , 48.  , 24.  , 42.  , 27.  ,
       31.  ,  4.  , 26.  , 47.  , 33.  , 47.  , 28.  , 15.  , 20.  ,
       19.  , 56.  , 25.  , 33.  , 22.  , 28.  , 25.  , 39.  , 27.  ,
       19.  , 26.  , 32.  ])

In [16]:
print("Ages:", ages[:10])

Ages: [22. 38. 26. 35. 35. 54.  2. 27. 14.  4.]

In [17]:
mean_age = np.mean(ages)

In [18]:
mean_age

29.69911764705882

In [19]:
ages_scaled = ages/ mean_age

In [20]:
ages_scaled

array([0.74076275, 1.27949929, 0.87544688, 1.17848619, 1.17848619,
       1.81823584, 0.06734207, 0.90911792, 0.47139448, 0.13468414,
       1.95291997, 0.67342068, 1.31317033, 0.47139448, 1.85190687,
       0.06734207, 1.04380205, 1.17848619, 1.14481516, 0.50506551,
       0.94278895, 0.26936827, 1.27949929, 0.63974965, 1.34684136,
       2.22228824, 0.94278895, 1.41418343, 0.70709171, 0.60607861,
       0.47139448, 1.34684136, 0.90911792, 0.1010131 , 0.63974965,
       0.60607861, 0.23569724, 0.70709171, 1.64988067, 0.97645999,
       2.18861721, 0.70709171, 0.95962447, 0.16835517, 0.37038137,
       0.74076275, 1.27949929, 1.51519653, 0.13468414, 0.97645999,
       0.63974965, 0.57240758, 0.87544688, 1.07747309, 0.53873654,
       0.70709171, 0.87544688, 1.07747309, 0.84177585, 0.02794696,
       1.01013102, 0.74076275, 0.97645999, 0.94278895, 0.57240758,
       1.11114412, 0.53873654, 0.77443378, 0.80810482, 0.97645999,
       0.67342068, 1.54886756, 0.87544688, 1.98659101, 2.39064341,
       0.77443378, 1.14481516, 1.14481516, 0.94278895, 0.70709171,
       1.11114412, 1.24582826, 0.94278895, 0.70709171, 1.27949929,
       1.5825386 , 0.48822999, 0.74076275, 0.67342068, 0.57240758,
       0.70709171, 2.3738079 , 0.97645999, 0.80810482, 0.06734207,
       0.70709171, 1.0943086 , 1.0943086 , 1.81823584, 0.40405241,
       0.80810482, 1.51519653, 1.11114412, 0.67342068, 1.5825386 ,
       0.97645999, 0.84177585, 0.77443378, 0.63974965, 1.24582826,
       0.53873654, 0.80810482, 0.74076275, 0.80810482, 0.63974965,
       0.60607861, 0.63974965, 0.90911792, 0.30303931, 1.22899274,
       1.41418343, 1.71722273, 0.74076275, 1.86874239, 1.36367688,
       1.71722273, 0.53873654, 1.01013102, 1.4815255 , 1.34684136,
       0.87544688, 0.57240758, 0.03367103, 0.30303931, 1.51519653,
       0.94278895, 2.05393307, 0.13468414, 0.03367103, 0.70709171,
       1.8855779 , 0.60607861, 1.6835517 , 1.01013102, 1.21215722,
       0.30303931, 0.03367103, 0.13468414, 1.51519653, 1.34684136,
       1.21215722, 1.07747309, 0.63974965, 0.63974965, 0.1010131 ,
       1.4815255 , 1.95291997, 1.41418343, 0.80810482, 0.94278895,
       1.14481516, 1.53203205, 0.60607861, 0.06734207, 1.07747309,
       0.87544688, 0.53873654, 1.34684136, 0.80810482, 1.17848619,
       0.74076275, 1.01013102, 1.04380205, 0.90911792, 1.41418343,
       1.07747309, 1.01013102, 0.53873654, 0.90911792, 1.71722273,
       1.27949929, 0.74076275, 0.63974965, 0.6902562 , 0.60607861,
       1.17848619, 0.97645999, 1.98659101, 0.16835517, 0.80810482,
       1.4815255 , 0.26936827, 0.63974965, 1.11114412, 0.97645999,
       0.74076275, 1.01013102, 1.4815255 , 0.84177585, 0.80810482,
       1.24582826, 1.81823584, 0.97645999, 2.08760411, 1.01013102,
       1.38051239, 0.97645999, 1.01013102, 1.17848619, 1.6835517 ,
       0.1010131 , 1.75089377, 1.34684136, 1.21215722, 0.53873654,
       0.84177585, 1.95291997, 1.17848619, 0.84177585, 1.38051239,
       1.24582826, 2.12127514, 1.51519653, 0.23569724, 1.17848619,
       2.18861721, 0.94278895, 0.53873654, 0.63974965, 1.11114412,
       1.01013102, 0.74076275, 1.41418343, 0.74076275, 0.87544688,
       0.63974965, 1.21215722, 0.80810482, 0.80810482, 0.7912693 ,
       0.06734207, 1.6835517 , 0.63974965, 0.03097735, 0.57240758,
       1.01013102, 1.01013102, 0.80810482, 0.60607861, 0.87544688,
       0.94278895, 1.44785446, 0.87544688, 0.80810482, 1.81823584,
       1.04380205, 1.34684136, 0.74076275, 0.90911792, 1.01013102,
       0.74076275, 1.21215722, 2.05393307, 1.21215722, 1.04380205,
       0.53873654, 1.53203205, 1.27949929, 0.53873654, 0.97645999,
       1.38051239, 1.51519653, 1.51519653, 0.06734207, 0.80810482,
       0.94278895, 0.84177585, 1.21215722, 0.80810482, 1.34684136,
       0.1010131 , 1.41418343, 0.77443378, 0.50506551, 0.84177585,
       0.94278895, 0.74076275, 1.27949929, 1.34684136, 0.97645999,
       1.51519653, 1.17848619, 1.01013102, 2.02026204, 0.80810482,
       0.84177585, 0.60607861, 0.63974965, 0.74076275, 0.1010131 ,
       0.74076275, 0.90911792, 0.67342068, 0.63974965, 1.41418343,
       0.03367103, 1.07747309, 1.17848619, 0.60607861, 0.03367103,
       1.21215722, 0.57240758, 1.21215722, 0.70709171, 0.94278895,
       0.77443378, 0.80810482, 0.74076275, 1.04380205, 1.54886756,
       0.77443378, 0.94278895, 1.31317033, 0.87544688, 0.70709171,
       0.94278895, 0.67342068, 1.14481516, 1.71722273, 0.1010131 ,
       0.70709171, 1.11114412, 1.4815255 , 1.14481516, 0.60607861,
       1.01013102, 0.33671034, 0.70709171, 0.97645999, 0.94278895,
       0.60607861, 0.94278895, 0.63974965, 1.07747309, 0.94278895,
       1.41418343, 0.57240758, 1.6835517 , 0.47139448, 0.70709171,
       0.80810482, 2.15494618, 1.04380205, 1.51519653, 0.67342068,
       0.84177585, 0.94278895, 0.13468414, 0.43772344, 1.14481516,
       0.16835517, 1.75089377, 1.21215722, 1.01013102, 1.64988067,
       0.97645999, 2.18861721, 1.6835517 , 1.61620963, 1.14481516,
       1.5825386 , 1.61620963, 1.27949929, 1.8855779 , 0.02525328,
       1.27949929, 1.11114412, 0.77443378, 0.74076275, 1.14481516,
       0.97645999, 0.74076275, 0.06734207, 0.30303931, 1.6835517 ,
       2.12127514, 0.84177585, 1.17848619, 1.95291997, 1.01013102,
       0.30303931, 0.70709171, 1.85190687, 2.39064341, 0.70709171,
       1.81823584, 0.84177585, 0.80810482, 0.57240758, 0.70709171,
       1.24582826, 0.53873654, 0.60607861, 1.11114412, 0.94278895,
       0.87544688, 0.97645999, 1.21215722, 1.81823584, 0.80810482,
       1.5825386 , 1.14481516, 1.21215722, 1.07747309, 1.01013102,
       0.74076275, 1.4815255 , 1.36367688, 1.6835517 , 1.31317033,
       0.77443378, 0.06734207, 0.57240758, 1.01013102, 0.23569724,
       1.51519653, 1.01013102, 0.74076275, 1.21215722, 0.30303931,
       0.37038137, 1.07747309, 1.6835517 , 2.15494618, 0.63974965,
       1.11114412, 0.26936827, 0.57240758, 0.90911792, 0.74076275,
       0.74076275, 2.08760411, 1.61620963, 1.31317033, 1.21215722,
       1.34684136, 0.94278895, 0.80810482, 0.63974965, 0.97645999,
       1.07747309, 2.08760411, 1.7845648 , 1.21215722, 0.53873654,
       0.63974965, 1.14481516, 1.31317033, 1.07747309, 0.84177585,
       1.31317033, 1.81823584, 1.21215722, 0.60607861, 1.5825386 ,
       2.02026204, 0.74076275, 1.17848619, 1.75089377, 1.5825386 ,
       1.24582826, 1.21215722, 1.64988067, 1.64988067, 0.80810482,
       1.4815255 , 1.17848619, 1.21215722, 1.01013102, 0.90911792,
       0.74076275, 1.34684136, 1.31317033, 1.17848619, 0.80810482,
       1.14481516, 0.87544688, 0.13468414, 0.87544688, 0.90911792,
       1.41418343, 0.67342068, 0.70709171, 0.70709171, 2.05393307,
       1.91924894, 0.70709171, 0.87544688, 2.69368272, 1.71722273,
       1.07747309, 0.30303931, 0.94278895, 1.07747309, 1.04380205,
       1.38051239, 0.67342068, 0.80810482, 0.06734207, 0.02525328,
       1.61620963, 0.63974965, 1.8855779 , 0.77443378, 0.60607861,
       0.70709171, 0.60607861, 0.80810482, 1.07747309, 0.77443378,
       1.95291997, 1.6835517 , 1.34684136, 1.5825386 , 1.21215722,
       0.67342068, 1.07747309, 0.84177585, 1.44785446, 1.34684136,
       1.04380205, 2.35697238, 1.04380205, 0.60607861, 0.82494033,
       0.60607861, 1.44785446, 1.21215722, 0.90911792, 0.67342068,
       0.47139448, 2.02026204, 0.84177585, 0.47139448, 0.63974965,
       0.60607861, 0.50506551, 1.04380205, 0.13468414, 0.84177585,
       2.02026204, 1.75089377, 1.4815255 , 1.64988067, 1.41418343,
       0.60607861, 1.17848619, 0.60607861, 0.84177585, 0.87544688,
       1.31317033, 1.51519653, 1.41418343, 0.74076275, 0.80810482,
       1.61620963, 0.97645999, 1.75089377, 0.63974965, 1.27949929,
       0.90911792, 1.11114412, 0.2020262 , 0.57240758, 1.14481516,
       1.6835517 , 0.90911792, 0.67342068, 1.01013102, 0.84177585,
       0.84177585, 0.97645999, 0.37038137, 0.77443378, 0.77443378,
       0.95962447, 1.61620963, 1.17848619, 1.21215722, 0.70709171,
       0.80810482, 1.04380205, 2.35697238, 0.53873654, 1.01013102,
       0.63974965, 1.04380205, 0.13468414, 0.2020262 , 1.11114412,
       0.77443378, 1.61620963, 0.02255959, 0.94278895, 0.60607861,
       1.14481516, 1.11114412, 1.38051239, 0.67342068, 1.21215722,
       0.53873654, 1.71722273, 1.02696654, 1.07747309, 0.80810482,
       1.61620963, 1.91924894, 1.81823584, 0.60607861, 0.16835517,
       1.44785446, 0.43772344, 0.57240758, 0.97645999, 0.84177585,
       0.84177585, 0.60607861, 0.26936827, 0.03367103, 1.54886756,
       0.53873654, 0.84177585, 1.31317033, 1.64988067, 1.04380205,
       1.01013102, 1.01013102, 1.14481516, 1.04380205, 0.37038137,
       0.01414183, 0.90911792, 1.04380205, 1.31317033, 0.60607861,
       1.31317033, 1.11114412, 0.87544688, 1.31317033, 1.17848619,
       0.2020262 , 1.02696654, 0.77443378, 1.04380205, 1.44785446,
       0.33671034, 1.75089377, 0.90911792, 1.27949929, 0.90911792,
       0.06734207, 0.03367103, 2.08760411, 0.50506551, 0.02794696,
       0.77443378, 0.60607861, 1.31317033, 0.70709171, 1.07747309,
       0.67342068, 0.53873654, 1.01013102, 1.16165067, 0.57240758,
       1.41418343, 1.17848619, 0.94278895, 0.13468414, 2.49165652,
       0.30303931, 0.53873654, 1.4815255 , 0.60607861, 1.51519653,
       1.71722273, 0.80810482, 1.38051239, 0.70709171, 1.61620963,
       0.80810482, 1.41418343, 0.90911792, 1.04380205, 0.13468414,
       0.87544688, 1.5825386 , 1.11114412, 1.5825386 , 0.94278895,
       0.50506551, 0.67342068, 0.63974965, 1.8855779 , 0.84177585,
       1.11114412, 0.74076275, 0.94278895, 0.84177585, 1.31317033,
       0.90911792, 0.63974965, 0.87544688, 1.07747309])

In [21]:
print("ages scaled: ", ages_scaled[:5])

ages scaled:  [0.74076275 1.27949929 0.87544688 1.17848619 1.17848619]

In [22]:
print("First 5 ages: ", ages[:5])

First 5 ages:  [22. 38. 26. 35. 35.]

In [23]:
print("Ages above 42: ", ages[ages>42])

Ages above 42:  [54.  58.  55.  66.  49.  65.  45.  46.  59.  71.  47.  70.5 54.  45.
 47.  51.  55.5 51.  44.  45.  61.  56.  50.  45.  44.  58.  45.5 51.
 59.  44.  44.  54.  62.  50.  52.  58.  63.  45.  65.  50.  43.  54.
 61.  45.5 45.  45.  45.  60.  46.  51.  44.  50.  64.  45.  52.  49.
 65.  50.  48.  47.  48.  56.  50.  63.  58.  55.  71.  54.  54.  47.
 44.  50.  45.  50.  64.  62.  48.  62.  53.  54.  47.  60.  52.  47.
 49.  49.  44.  61.  57.  80.  51.  48.  56.  58.  50.  47.  43.  70.
 43.  60.  60.  52.  44.  49.  45.  48.  52.  50.  48.  70.  48.  51.
 48.  57.  54.  43.  46.  49.  43.  52.  62.  74.  44.  45.  51.  48.
 47.  47.  56. ]

In [24]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [25]:
titanic['age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [26]:
titanic[['age', 'sex', 'fare']].head()

    age     sex     fare
0  22.0    male   7.2500
1  38.0  female  71.2833
2  26.0  female   7.9250
3  35.0  female  53.1000
4  35.0    male   8.0500

In [27]:
titanic[['age', 'sex', 'fare']]

      age     sex     fare
0    22.0    male   7.2500
1    38.0  female  71.2833
2    26.0  female   7.9250
3    35.0  female  53.1000
4    35.0    male   8.0500
..    ...     ...      ...
886  27.0    male  13.0000
887  19.0  female  30.0000
888   NaN  female  23.4500
889  26.0    male  30.0000
890  32.0    male   7.7500

[891 rows x 3 columns]

In [28]:
titanic[titanic['sex'] == 'female']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [29]:
males = len(titanic[titanic['sex'] == 'male'])

In [30]:
males

577

In [31]:
females = len(titanic[titanic['sex'] == 'female'])

In [32]:
females

314

In [33]:
titanic[titanic['fare']>50]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,female,45.0,1,1,164.8667,S,First,woman,False,NaN,Southampton,yes,False
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
867,0,1,male,31.0,0,0,50.4958,S,First,man,True,A,Southampton,no,True
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False

In [34]:
titanic.groupby('sex')['age'].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [35]:
titanic['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [36]:
titanic['sex'].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [37]:
titanic.groupby('class')['survived']

In [38]:
titanic.groupby('class')['survived'].mean()

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64

In [39]:
titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [40]:
titanic['age'].fillna(titanic['age'].mean(), inplace = True)

C:\Users\Bhakti\AppData\Local\Temp\ipykernel_18352\1074412273.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  titanic['age'].fillna(titanic['age'].mean(), inplace = True)

In [41]:
titanic.fillna({'age': titanic['age'].mean()}, inplace = True)

In [42]:
titanic.dropna(inplace = True)

In [43]:
titanic.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [44]:
titanic['fare'].mean()

76.30530746268657

In [45]:
age18 = titanic[ titanic['age']==18]

In [46]:
titanic.groupby('age' == age18)['survived'=True].value_counts()

SyntaxError: cannot assign to literal here. Maybe you meant '==' instead of '='? (3906550337.py, line 1)

In [47]:
titanic.groupby('age' == age18)['survived' == True].value_counts()

ValueError: Grouper for '<class 'pandas.core.frame.DataFrame'>' not 1-dimensional

In [48]:
titanic.groupby('age')['survived'].value_counts()

age    survived
0.92   1           1
1.00   1           1
2.00   0           2
       1           1
3.00   1           1
                  ..
64.00  0           1
65.00  0           2
70.00  0           1
71.00  0           1
80.00  1           1
Name: count, Length: 90, dtype: int64

In [49]:
children = titanic[titanic['age']<18]

In [50]:
children['survived'].mean()

0.8947368421052632

In [52]:
titanic[titanic['sibsp'==0]].value_counts()

KeyError: False

In [53]:
sibsp0 = titanic[titanic['sibsp']==0]

In [54]:
sibsp0.value_counts()

survived  pclass  sex     age   sibsp  parch  fare      embarked  class  who    adult_male  deck  embark_town  alive  alone
1         1       female  24.0  0      0      69.3000   C         First  woman  False       B     Cherbourg    yes    True     2
0         1       female  50.0  0      0      28.7125   C         First  woman  False       C     Cherbourg    no     True     1
1         1       female  44.0  0      1      57.9792   C         First  woman  False       B     Cherbourg    yes    False    1
                  male    27.0  0      0      76.7292   C         First  man    True        D     Cherbourg    yes    True     1
                          26.0  0      0      30.0000   C         First  man    True        C     Cherbourg    yes    True     1
                                                                                                                              ..
0         1       male    62.0  0      0      26.5500   S         First  man    True        C     Southampton  no     True     1
                          61.0  0      0      33.5000   S         First  man    True        B     Southampton  no     True     1
                                              32.3208   S         First  man    True        D     Southampton  no     True     1
                          58.0  0      2      113.2750  C         First  man    True        D     Cherbourg    no     False    1
1         3       male    32.0  0      0      8.0500    S         Third  man    True        E     Southampton  yes    True     1
Name: count, Length: 122, dtype: int64

In [56]:
parch0 = titanic[titanic['parch']==0]

In [57]:
parch0.value_counts()

survived  pclass  sex     age   sibsp  parch  fare     embarked  class  who    adult_male  deck  embark_town  alive  alone
1         1       female  24.0  0      0      69.3000  C         First  woman  False       B     Cherbourg    yes    True     2
0         1       female  50.0  0      0      28.7125  C         First  woman  False       C     Cherbourg    no     True     1
1         1       female  58.0  0      0      26.5500  S         First  woman  False       C     Southampton  yes    True     1
                          49.0  1      0      76.7292  C         First  woman  False       D     Cherbourg    yes    False    1
                          51.0  1      0      77.9583  S         First  woman  False       D     Southampton  yes    False    1
                                                                                                                             ..
0         1       male    61.0  0      0      33.5000  S         First  man    True        B     Southampton  no     True     1
                                              32.3208  S         First  man    True        D     Southampton  no     True     1
                          58.0  0      0      29.7000  C         First  man    True        B     Cherbourg    no     True     1
                          56.0  0      0      30.6958  C         First  man    True        A     Cherbourg    no     True     1
1         3       male    32.0  0      0      8.0500   S         Third  man    True        E     Southampton  yes    True     1
Name: count, Length: 137, dtype: int64